"use client";

import { TermsSection } from "./TermsSection";
import { TermsText } from "./TermsText";
import { IoCloseSharp } from "react-icons/io5";

export function Terms({ open, close }) {
  return (
    <div
      className='fixed inset-0 w-dvw h-dvh flex justify-center pt-20 bg-beige transition-all duration-300 overflow-auto'
      style={{ opacity: open ? 1 : 0, pointerEvents: open ? "auto" : "none" }}
    >
      <div className='relative max-w-[1280px] md:pl-8 pl-6 pr-4 md:mx-16 mx-2 border-l-4 border-l-black flex flex-col gap-8 overflow-auto mb-8'>
        <div className='flex justify-between items-center sticky top-[-2px] pb-2 md:pr-4 w-full bg-beige border-b-2 border-b-coffee/20'>
          <p className='md:text-4xl text-2xl font-bold'>
            Условия за наем на кемперван от Gypsy vans
          </p>
          <button className='text-5xl' onClick={close}>
            <IoCloseSharp />
          </button>
        </div>
        <TermsSection title='1. Общи разпоредби.'>
          <TermsText>
            В случай на несъответствие между Общите условия и клаузите на
            подписания индивидуален договор за наем, предимство се дава на
            последните. Правната връзка между страните се разглежда в
            съответствие с българското законодателство. Всички спорове,
            произтичащи от тълкуването и прилагането на Договора, ще бъдат
            решавани от страните посредством разбирателство и взаимни
            компромиси, а в случай на невъзможност - от компетентния Български
            съд.
          </TermsText>
        </TermsSection>
        <TermsSection title='2. Сключване на договор.'>
          <TermsText>
            2.1. Договорът се счита за сключен, когато е подписан, при условие,
            че са платени изискваният депозит, дължимата сума за наем, съгласно
            индивидуалния договор. След като НАЕМОДАТЕЛЯТ потвърди успешната
            резервация, тя става непроменима. Промени в съществуващата
            резервация могат да се направят само след изричното писмено съгласие
            на НАЕМОДАТЕЛЯ и при наличие на свободен автомобил за съответния
            период.
          </TermsText>
          <TermsText>
            2.2. В рамките на 24 часа след успешната резервация НАЕМАТЕЛЯТ
            трябва да сключи Договор за наем за избрания автомобил за заявения
            период и да заплати авансово 50% от общата наемна цена за периода на
            наема.
          </TermsText>
          <TermsText>
            2.3. Не по-късно от 20 дни преди началото на наемния период трябва
            да бъдат платени и представени:
            <ul className='pt-1'>
              <li className='pl-4'>
                {" "}
                • цялата сума за наема за договорения период на ползване на
                кемпер;
              </li>
              <li className='pl-4'> • копие от шофьорската книжка и талона;</li>
              <li className='pl-4'>
                {" "}
                • копие от личната карта или международния паспорт (за държави
                извън ЕС със срок на валидност не по-малко от 6 месеца от датата
                на връщане).
              </li>
            </ul>
          </TermsText>
          <TermsText>
            2.4. Наемната цена трябва да бъде платена в брой или по банков път
            на следната банкова сметка на НАЕМОДАТЕЛЯ:
          </TermsText>
          <TermsText className='font-bold text-lg uppercase'>
            Джипси Ванс ООД <br />
            Име на банка: Банка ДСК <br />
            IBAN: BG44STSA93000030956654 <br />
            BIC: STSABGSF <br />
          </TermsText>
        </TermsSection>
        <TermsSection title='3. Анулиране на резервация.'>
          <TermsText>
            НАЕМОДАТЕЛЯТ има право да анулира резервацията при следните условия:
            <ul className='pt-1'>
              <li className='pl-4'>
                {" "}
                • Ако в рамките на 24 часа от направената резервация не се
                сключи Договор за наем и не се заплати изискваната авансова
                сума.
              </li>
              <li className='pl-4'>
                {" "}
                • Ако свидетелството за управление на МПС, личната карта или
                международният паспорт на водача изтичат след по-малко от  2
                месеца от крайната дата на наемния срок.
              </li>
              <li className='pl-4'>
                {" "}
                • Ако срокът за плащане на пълната наемна цена и/или
                гаранционния депозит не е спазен.
              </li>
              <li className='pl-4'>
                {" "}
                • Ако лицето, направило резервацията, предостави грешни или
                неточни данни.
              </li>
              <li className='pl-4'>
                {" "}
                • Във всички горепосочени случаи, ако НАЕМАТЕЛЯ е внесъл
                плащания, те НЕ се възстановяват.
              </li>
            </ul>
          </TermsText>
        </TermsSection>
        <TermsSection title='4. Отказ от резервация.'>
          <TermsText>
            4.1. Ако НАЕМАТЕЛЯТ направи отказ до 31 дни преди датата на
            резервацията, НАЕМОДАТЕЛЯТ възстановява 100% от платената авансова
            сума.
          </TermsText>
          <TermsText>
            4.2. Ако НАЕМАТЕЛЯТ направи отказ от 30 до 14 дни преди датата на
            резервацията, НАЕМОДАТЕЛЯТ възстановява 50% от платената авансова
            сума.
          </TermsText>
          <TermsText>
            4.3. Ако НАЕМАТЕЛЯТ направи отказ от 14 до 7 дни преди датата на
            резервацията, НАЕМОДАТЕЛЯТ възстановява 35% от пълната сума на
            наемния период.
          </TermsText>
          <TermsText>
            4.4. Ако НАЕМАТЕЛЯТ направи отказ под 7 дни преди датата на
            резервацията, НАЕМОДАТЕЛЯТ не възстановява платената сума за целия
            наемен период.
          </TermsText>
        </TermsSection>
        <TermsSection title='5. Изисквания към водачите на МПС:'>
          <TermsText>
            5.1. Да са на възраст между 21 години и 65 години.
          </TermsText>
          <TermsText>
            5.2. Да притежават шофьорска книжка категория В /или по-висока/.
          </TermsText>
          <TermsText>
            5.3. Да имат поне две години стаж като активен шофьор.
          </TermsText>
          <TermsText>
            <span className='font-bold'>Важно: </span>
            Шофьор, на който са наложени медицински или законови ограничения за
            шофиране, задължително информира НАЕМОДАТЕЛЯ предварително.
          </TermsText>
        </TermsSection>
        <TermsSection title='6. Предаване и връщане на наетото МПС.'>
          <TermsText>
            6.1. Наетото МПС трябва да бъде предадено и върнато в уговорения ден
            и времеви диапазон, отбелязани в договора за наем.времеви диапазон
            между 10:00 ч. и 16:00 ч.
          </TermsText>
          <TermsText>
            6.2. При предаването на наетото МПС, трябва да бъдат представени
            оригиналите на личната карта (документ за самоличност) и
            свидетелството за правоуправление.
          </TermsText>
          <TermsText>
            6.3. НАЕМАТЕЛЯТ гарантира, че само лицата, които са вписани в
            момента на сключване на договора като допълнителни шофьори, ще
            управляват наетото МПС и че те отговарят на изискванията за водачи
            на МПС, посочени в настоящите Общи условия.
          </TermsText>
          <TermsText>
            6.4. За да се осъществи предаването на наетото МПС на НАЕМАТЕЛЯ, е
            необходимо да бъдат представени валидни свидетелства за управление
            на МПС на всички заявени шофьори. Ако документите не са представени
            в разумен срок, НАЕМОДАТЕЛЯТ може да анулира договора с всички
            имуществени последици, свързани с анулиране на резервацията.
          </TermsText>
          <TermsText>
            6.5. При предаването на наетото МПС, НАЕМАТЕЛЯТ трябва да се увери,
            че то е в добро работно състояние и отговаря на условията, посочени
            в договора, включително наличието на договореното оборудване и
            консумативи. С подписването на приемо-предавателния протокол,
            НАЕМАТЕЛЯТ декларира, че обстоятелствата, свързани със състоянието
            на наетото МПС и наличието на оборудването, консумативите и нивото
            на течности, са вярно отразени в протокола. Приемо-предавателният
            протокол се подписва от двете страни и става неразделна част от
            договора.
          </TermsText>
          <TermsText>
            6.6. Наетият кемперван се връща между 10:00 и 16:00 часа на
            уговорената дата за връщане (деня, в който изтича наемният срок).
          </TermsText>
          <TermsText>
            6.7. Ако забавите и върнете кемпера след 16:00 часа без това
            предварително да е координирано с НАЕМОДАТЕЛЯТ, ще бъдете задължени
            да заплатите 25€ за всеки започнат час на забавяне до 20:00 часа на
            същия ден. <br />
            Ако забавите връщането на кемпера след 20:00 часа на уговорената
            дата за връщане, кемперът трябва да бъде върнат в 9:00 часа на
            следващия ден с допълнителна такса от 100€. <br />
            При забавяне за връщане на кемпера след 9:00 часа на деня след
            уговорената дата за връщане, ще бъдете задължени да заплатите 25€ за
            всеки започнат час след 9:00 часа до момента на връщане на кемпера.
          </TermsText>
          <TermsText>
            6.8. Състоянието на наетия кемпер при връщането му се записва в
            приемо-предавателния протокол, който се подписва от двете страни и е
            неразделна част от договора.
          </TermsText>
          <TermsText>
            6.9. Кемпервановете се взимат и връщат от наемателя на територията
            на гр. София, освен ако това не е изрично уговорено и записано в
            Договора.
          </TermsText>
        </TermsSection>
        <TermsSection title='7. Депозит.'>
          <TermsText>
            7.1. При получаване на наетото МПС, НАЕМАТЕЛЯТ трябва да заплати
            депозит в размер на 650 €.
          </TermsText>
          <TermsText>
            7.2. НАЕМОДАТЕЛЯТ не е задължен да предаде наетия автомобил, докато
            не бъде заплатен изискваният депозит.
          </TermsText>
          <TermsText>
            7.3. Депозитът ще бъде възстановен на НАЕМАТЕЛЯ, ако:
            <ul className='pt-1'>
              <li className='pl-4'>
                {" "}
                • Наетият кемперван е върнат в отлично състояние, без повреди и
                липси както по автомобила, така и по прилежащото оборудване;
              </li>
              <li className='pl-4'>
                {" "}
                • Наетият кемперван е зареден с гориво, с почистена тоалетна и
                всички ключове са налице, без липси по обзавеждането и силно
                изразени замърсявания и повреди по оборудването. .
              </li>
            </ul>
          </TermsText>
          <TermsText>
            7.4. Всички допълнителни разходи, включително разходи за почистване,
            зареждане с гориво и поправка на повреди, ще бъдат приспаднати от
            депозита, ако са задължение на НАЕМАТЕЛЯ. В случай на установени
            повреди и/или липси, НАЕМОДАТЕЛЯТ има право да задържи депозита до
            оценяването им в разумен срок, след което ще бъде възстановена
            остатъчната сума от задържания депозит.
          </TermsText>
          <TermsText>
            7.5. Оценката на повредите и липсите ще бъде направена според
            ценовата листа на НАЕМОДАТЕЛЯ.
          </TermsText>
        </TermsSection>
        <TermsSection title='8. Допълнителни такси при връщане на кемпер.'>
          <TermsText>
            <span className='font-bold'>
              При връщане на наетото МПС могат да бъдат начислени допълнителни
              такси:
            </span>
            <ul className='pt-1'>
              <li className='pl-4'>
                {" "}
                • Задължителна, еднократна такса за вътрешно и външно почистване
                – 55€
              </li>
              <li className='pl-4'> • За непочистена тоалетна касета - 35€</li>
              <li className='pl-4'>
                {" "}
                • При непълен резервоар с гориво се начислява такса от 15€ +
                стойността на горивото;
              </li>
              <li className='pl-4'>
                {" "}
                • Такса за връщане на кемпера в силно замърсен вид (с петна по
                дамаските, пода, стените и други повърхности, които изискват
                почистване или специално третиране) - 80€
              </li>
              <li className='pl-4'>
                {" "}
                • При спукване на гума на кемпера и несъобщаване на Наемодателя
                в подходящ срок по време на наемния период, разходите за
                използване на "Сървиз пакет", който включва компресор с тубичка
                и пълнител, се поемат от Наемателя - цена 65 €, плюс цената на
                гумата.
              </li>
            </ul>
          </TermsText>
        </TermsSection>
        <TermsSection title='9. Застраховки.'>
          <TermsText>
            9.1. НАЕМОДАТЕЛЯТ предоставя наетия кемпер с валидни застраховки
            "Гражданска отговорност" и "Автокаско" с пълно покритие, включително
            асистанс пакет, за територията на България.
          </TermsText>
          <TermsText>
            9.2. При управление на наетия кемпер в чужбина, НАЕМАТЕЛЯТ трябва да
            има предвид приложимите застрахователни покрития в съответната
            държава, които могат да се различават от покритието в България по
            отношение на обхвата и покритите рискове. НАЕМАТЕЛЯТ трябва да се
            запознае предварително със специфичните застрахователни покрития,
            както и с местните правила за движение.
          </TermsText>
          <TermsText>
            9.3. За сигурността и спокойствието на Наемателя по време на
            пътуването, препоръчваме сключването на следните застраховки:
            <ul className='pt-1'>
              <li className='pl-4'> • Застраховка срещу всички рискове.</li>
              <li className='pl-4'> • Застраховка за отказ на резервация.</li>
              <li className='pl-4'> • Медицинска застраховка.</li>
            </ul>
          </TermsText>
        </TermsSection>
        <TermsSection title='10. Поведение в случай на пътен инцидент.'>
          <TermsText>
            10.1. В случай на инцидент (кражба, пожар и др.), НАЕМАТЕЛЯТ трябва
            незабавно да информира полицията. Той трябва да остане на мястото на
            инцидента, докато изпълни своите задължения пред полицията, които
            включват разясняване на обстоятелствата и помощ в установяването на
            фактите. Ако липсва официален протокол, съставен от полицията,
            НАЕМАТЕЛЯТ трябва да докаже, че това не се дължи на неговото
            поведение. Възможно най-скоро НАЕМАТЕЛЯТ трябва да уведоми
            НАЕМОДАТЕЛЯ писмено за възникналата ситуация, представяйки пълната
            необходима информация и документи, включително имената и адресите на
            свидетели или участници в инцидента, както и регистрационните номера
            на възможно участващите превозни средства.
          </TermsText>
          <TermsText>
            10.2. Всички повреди, нанесени на наетото МПС по време на наемния
            период и за които НАЕМАТЕЛЯТ не предостави официален протокол за
            пътен инцидент, издаден от полицията или съответните официални
            органи в чужбина, са напълно в отговорността на НАЕМАТЕЛЯ.
          </TermsText>
        </TermsSection>
        <TermsSection title='11. Поведение в случай на повреда.'>
          <TermsText>
            11.1. НАЕМОДАТЕЛЯТ предоставя телефонен номер за докладване на
            всякакви възникнали повреди по наетото МПС. НАЕМАТЕЛЯТ трябва
            незабавно да информира за всяка възникнала повреда, предоставяйки
            пълната налична информация за случая. Ако НАЕМОДАТЕЛЯТ го изиска,
            НАЕМАТЕЛЯТ трябва да посети определен от НАЕМОДАТЕЛЯ сервиз за
            диагностика или отстраняване на повредата, дори ако има други
            сервизни услуги, по-близки до наличното местоположение.
          </TermsText>
        </TermsSection>
        <TermsSection title='12. Отговорности на НАЕМАТЕЛЯ.'>
          <TermsText>
            12.1. НАЕМАТЕЛЯТ носи отговорност за повреди, кражби и други щети,
            които са в резултат на неизпълнение на задълженията му по договора.
          </TermsText>
          <TermsText>
            12.2. При наличие на договор с няколко лица, те са солидарно
            отговорни пред НАЕМОДАТЕЛЯ или трети лица.
          </TermsText>
          <TermsText>
            12.3. НАЕМАТЕЛЯТ се съгласява да обезщети НАЕМОДАТЕЛЯ за всички
            такси, задължения, глоби, фишове, актове и санкции, свързани с
            нарушенията по време на наемния период.
          </TermsText>
        </TermsSection>
        <TermsSection title='13. Задължения на НАЕМАТЕЛЯ относно сигурността на наетото МПС.'>
          <TermsText>
            13.1. Наетото МПС трябва да се управлява и съхранява с грижа, като
            се следят редовно нивата на гориво, вода, налягането на гумите и
            други. МПС трябва да се използва съгласно спецификациите и
            проведения инструктаж, и винаги трябва да бъде заключено, когато е
            оставено без надзор. При напускане наетото МПС, НАЕМАТЕЛЯТ трябва да
            носи ключовете и документите със себе си и да ги пази от достъпа на
            неоторизирани лица. Трябва да се спазват всички правила за движение
            и технически изисквания. Нарушаването на тези задължения може да
            доведе до ограничаване или анулиране на застраховката на МПС-то.
            НАЕМАТЕЛЯТ трябва да съобразява поведението си с размерите на
            наетото МПС, като всички щети, причинени от неспазване на
            максималната височина и дължина, са напълно за негова сметка. В този
            случай не се предоставя застраховка срещу всички рискове.
          </TermsText>
          <TermsText>
            13.2. Забранено е транспортирането на горива и запалителни материали
            с наетото МПС.
          </TermsText>
          <TermsText className='underline'>
            13.3. Не е разрешено свързването на устройства с неизяснен произход,
            които могат да представляват риск от пожар в наетия автомобил, като
            например техника за 220 волта и други уреди, които не са
            предоставени от НАЕМОДАТЕЛЯ.
          </TermsText>
          <TermsText>
            13.4. Забранено е кемперванът да бъде използван за теглене на други
            превозни средства или да бъде теглен от друго превозно средство.
          </TermsText>
          <TermsText>
            13.5. Абсолютно е забранено пушенето на цигари, пури, електронни
            устройства за пушене, както и употребата на наркотични вещества и
            субстанции в кемпера. При установяване на нарушение на това правило,
            клиентът ще бъде таксуван със сума от 800€. 
          </TermsText>
          <TermsText>
            13.6. Пътуванията до други държави са разрешени само след получаване
            на предварителното писмено съгласие от НАЕМОДАТЕЛЯ.
          </TermsText>
          <TermsText>
            13.7. НАЕМАТЕЛЯТ е задължен да се запознае с приложимите правила за
            движение в съответната държава и да ги спазва.
          </TermsText>
        </TermsSection>
        <TermsText>
          Наемодателят има право да изменя и допълва общите условия по всяко
          време. Тези условия влизат в сила от 18.09.2024 г.
        </TermsText>
      </div>
    </div>
  );
}
